/********************************************************************
 *@file        key.c
 *@author      Woody      QQ：2490006131
 *@version     V1.0
 *@date        2016-10-14
 *@brief       KEY初始化以及扫描函数
 *******************************************************************/
#include "key.h"
#include "led.h"
#include "delay.h"

/*******************************************************************************
 * 函数名：key_init
 * 描述  ：配置key的初始化
 * 输入  ：无
 * 输出  ：无
 * 调用  ：外部调用
 ******************************************************************************/
void key_init(void)
{
    /* 定义KEY的管脚为输入模式 */
    GPIO_Init(KEY_PORT_1, KEY_1, GPIO_MODE_IN_PU_NO_IT);
}



/*******************************************************************************
 * 函数名：key_scan
 * 描述  ：配置key扫描函数
 * 输入  ：无
 * 输出  ：无
 * 调用  ：外部调用
 ******************************************************************************/
void key_scan(void)
{
  if(GPIO_ReadInputPin(GPIOA, GPIO_PIN_1) == 0)
   {
       DJ_HL_Z(); 
   }
  else 
  {
       DJ_HL_F(); 
  }
}

/*******************************************************************************
 * 函数名：GPIO_INIT
 * 描述  ：配置GPIO初始化函数，前一级检测
 * 输入  ：无
 * 输出  ：无
 * 调用  ：外部调用
 ******************************************************************************/
void GPIO_INIT(void)
{
  GPIO_Init(GPIOC, GPIO_PIN_4, GPIO_MODE_OUT_PP_HIGH_FAST );  //AIN+
  GPIO_Init(GPIOD, GPIO_PIN_3, GPIO_MODE_OUT_PP_HIGH_FAST );  //PWM
}

/*******************************************************************************
 * 函数名：DJ_HL_Z
 * 描述  ：配置DJ_HL_Z函数
 * 输入  ：无
 * 输出  ：无
 * 调用  ：外部调用
 ******************************************************************************/
void  DJ_HL_Z(void)
{  
  GPIO_WriteHigh(GPIOC, GPIO_PIN_4);  
}    
    
/*******************************************************************************
 * 函数名：DJ_HL_F
 * 描述  ：配置DJ_HL_F函数
 * 输入  ：无
 * 输出  ：无
 * 调用  ：外部调用
 ******************************************************************************/
void  DJ_HL_F(void)
{
   GPIO_WriteLow(GPIOC, GPIO_PIN_4);
}


